# IsMerging Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DocumentReloadLatestProgressChangedEventArgs..::..IsMerging Property
DocumentReloadLatestProgressChangedEventArgs Class See Also
---
Indicates if it is merging downloaded data.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017 Subscription Update
# Syntax
C#
---
```text
public bool IsMerging { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsMerging As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsMerging {
	bool get ();
}
```

# See Also
DocumentReloadLatestProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace